Revit 2027 API
BuiltInFailures.TilePatternTileFailures.TilePatternTile_InvalidFamily Property
 Family not appropriate for Divided Surface component.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TilePatternTile_InvalidFamily { get; }
Public Shared ReadOnly Property TilePatternTile_InvalidFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TilePatternTile_InvalidFamily {
	FailureDefinitionId^ get ();
}
static member TilePatternTile_InvalidFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TilePatternTileFailures Class
Autodesk.Revit.DB Namespace